// 알고리즘(Algorithm)
//  : 알고리즘은 문제를 해결하기 위한 생각의 흐름을 순차적으로 구현하는 단계적인 절차 = 데이터 처리 순서도 <Flow Chart> 

//	# 값(데이터)이 다른 경우라도 문제의 유형이 같다 (= 동일한 절차로 결과값을 유도 할 수 있음을 의미)
//	  -> 1가지 문제에 대해 여러 종류의 알고리즘이 있을 수 있지만, 효율적인 알고리즘을 고안하는 것이 매우 중요.

//	- 알고리즘 복잡도 분석 
//	  : 효율적인 알고리즘은 어떤 기준으로 구분?
//	     -> 알고리즘이 수행하는 연산의 '횟수'가 중요 -> 연산의 횟수는 n의 함수로 표기 -> 극한연산을 통해 상수를 제외하고 가장 큰 차수만 측정 (= 빅 오(Big O) 표기법)
// 
//	  #분석 유형
//	    1. 시간 복잡도 분석
//	       : 코드의 수행시간을 기준으로 분석
//	    2. 공간 복잡도 분석
//	       : 수행 시 필요로 하는 메모리 공간 분석